1. Executive Summary

  Tryhackme room: tryhackme.com/room/contiransomwarehgh
  
  Incident Type: Ransomware (Conti Ransomware tied to the TrickBot ecosystem and the Ryuk ransomware) 
  
  Compromised Host: win-aoqkg2as2q7 (Domain: bellybear.local)
  
  Summary: Threat actors gained initial access to the internal network by exploiting web vulnerabilities to drop an ASPX web shell. They successfully escalated privileges, established persistence via a backdoor account, and ultimately deployed ransomware. 

2. Indicators of Compromise (IoCs)

  Malicious Files & Paths:
  
    Malicious Hashes: * MD5: 290C7DFB01E50CEA9E19DA81A781AF2C (Ransomware)
    
    C:\Users\Administrator\Documents\cmd.exe (Ransomware)
    
    readme.txt (Ransom Note)
    ...\owa\auth\i3gfPctK1c2x.aspx (Web Shell)
  
  Compromised/Rogue Accounts:
  
    Username: securityninja (Password: hardToHack123$)

3. Technical Attack Narrative (The Kill Chain)

  Initial Access & Execution: The attacker accessed the system by interacting with a web shell named i3gfPctK1c2x.aspx.
  
  Persistence: The attacker established a backdoor by creating a new local user account (securityninja) using the net user /add command.
  
  Defense Evasion & Credential Access: The attacker utilized process injection (Sysmon Event ID 8) to migrate execution from PowerShell (powershell.exe) into unsecapp.exe, and subsequently into the Local Security Authority Subsystem Service (lsass.exe). This was done to steal credential hashes.
  
  Impact: The attacker executed the ransomware causing the files to be encrypted, deliberately renamed to cmd.exe. It generated mass file creations across the disk, alongside spread a readme.txt ransom note.


4. Proof of concept 

  Ransomware location:
  
    	Splunk command: 
    	  index=* sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=11 host="win-aoqkg2as2q7"  Image="c:\\Users\\Administrator\\Documents\\cmd.exe" | rex field=TargetFilename "(?<extension>\.[^\.]+)$" 
  
  Attacker created a new user account 
  
    Command used:  net  user /add securityninja hardToHack123$
  
  Attacker migrated from one process to another 
  
    	From 
  	  C:\Windows\System32\WindowsPowerShell\v1.0\powershell.exe
  	   into 
      C:\Windows\System32\wbem\unsecapp.exe
  
    Sysmon event 08 - create remote thread 
    Splunk command: 	
      Index=* EventCode=8
    	| table _time, host, SourceImage, TargetImage 
      | sort _time 
  
    
  System hash:
  
    So C:\Windows\System32\lsass.exe image was used to get the hash 
  
  
  Webshell: 
  
    i3gfPctK1c2x.aspx
    Splunk command:
    	index=* sourcetyp  e="*iis*" host="win-aoqkg2as2q7" (cs_uri_stem="/owa*" OR cs_uri_stem="/ecp*")
    	| stats count by c_ip, cs_method, cs_uri_stem, cs_uri_query, sc_status
      | sort - count
  
    Command line used for webshell:
    
      attrib.exe  -r \\\\win-aoqkg2as2q7.bellybear.local\C$\Program Files\Microsoft\Exchange Server\V15\FrontEnd\HttpProxy\owa\auth\i3gfPctK1c2x.aspx
  
    	Splunk command: index=* sourcetype="wineventlog:microsoft-windows-sysmon/operational" *aspx
  
  
  CVEs:
  
    CVE-2018-13374
    CVE-2018-13379
    CVE-2020-0796
